// Прочитайте главу 4 книги Роберта Мартина «Чистый код».
// Выпишите ниже рекомендации по употреблению комментариев в коде.
//
// Рекомендации:
// - 

#include <iostream>

int main() {
    std::cout << "There is no useful output. Read comments" << std::endl;
}
//Рекомендации:
//1.Грамотное применение комментариев должно компенсировать нашу неудачу
//в выражении своих мыслей в коде
//2.Ясный и выразительный код с минимумом комментариев гораздо лучше громоздкого, сложного кода с большим количеством
// комментариев.
//3.Заявление об авторских правах — необходимая информация, которая вполне может размещаться в комментарии в
// начале каждого файла с исходным кодом
//4.Коментарий следует использовать для изложения своих намерений, для прояснения чего либо, для предупреждения о
// последствиях, для акцентирования внимания на чем либо или же для заметок на будующее(TODO).